[{"summary": "Writing Workshop with Science Communicator in Residence Adam Becker", "location": "https://berkeley.zoom.us/j/95040632440", "description": "Description\nThis is an in-person only event.\nPlease join journalist and author Adam Becker for a workshop on the craft and practice of science writing.\nIn the first hour of this workshop, Adam Becker will explain how to write about science for a wide audience. He’ll discuss finding good ideas, weaving compelling narratives, and how to break down difficult concepts. In the second hour, he will open up the floor to questions, and discuss the details of how to get your writing published — on a news website, as a book, and everything in between.\nIn the weeks after, if there is interest, Adam will review short pieces of writing from a small handful of workshop participants (ten slots available). He will offer editing advice and suggestions on how to get those pieces published.\nParticipants should prepare by reading “Shitty First Drafts,” by Anne Lamott: https://wrd.as.uky.edu/sites/default/files/1-Shitty%20First%20Drafts.pdf, as well as this article Adam wrote for Scientific American: https://www.scientificamerican.com/article/physicists-criticize-stephen-wolframs-theory-of-everything/\n\n\n\n\n\n\n\n\n\n\nAll scheduled dates:\n\n\n\nUpcoming\n\n\n\n\n\n\n\nWriting Workshop with Science Communicator in Residence Adam Becker\n\n\n\n\n\n\n\nMar. 6, 2023\n\n1:30   –  3:30 p.m.\n\n\nWriting Workshop with Science Communicator in Residence Adam Becker\n\n\n\n\n\n\n\n\n\n\n\nShow more\n\n\n\n\n\nPast\n\n\nNo Past activities yet", "start": {"dateTime": "2023-03-06T13:30:00-08:00", "timeZone": "America/Los_Angeles"}, "end": {"dateTime": "2023-03-06T15:30:00-08:00", "timeZone": "America/Los_Angeles"}, "reminders": {"useDefault": true}}, {"summary": "Quantum Colloquium – The Quantum Fourier Transform Has Small Entanglement", "location": "https://berkeley.zoom.us/j/95040632440", "description": "Description\nThe Quantum Fourier Transform (QFT) is a key component of many important quantum algorithms, most famously as being the essential ingredient in Shor's algorithm for factoring products of primes. Given its remarkable capability, one would think it can introduce large entanglement to qubit systems and would be difficult to simulate classically. While early results showed QFT indeed has maximal operator entanglement, we show that this is entirely due to the bit reversal in the QFT. The core part of the QFT has Schmidt coefficients decaying exponentially quickly, and thus it can only generate a constant amount of entanglement regardless of the number of qubits. In addition, we show the entangling power of the QFT is the same as the time evolution of a Hamiltonian with exponentially decaying interactions, and thus a variant of the area law for dynamics can be used to understand the low entanglement intuitively. Using the low entanglement property of the QFT, we show that classical simulations of the QFT on a matrix product state with low bond dimension only take time linear in the number of qubits, providing a potential speedup over the classical fast Fourier transform (FFT) on many classes of functions. We demonstrate this speedup in test calculations on some simple functions. For data vectors of length 10^6 to 10^8, the speedup can be a few orders of magnitude.\nBio: Chris (Jielun) Chen is a first-year graduate student at Caltech, (tentatively) supervised by Garnet Chan and John Preskill. Previously he was an undergrad at UC Irvine, with research experiences under Steve White. He's interested in the interface of quantum information and tensor network theory.\n\n\n\n\n\n\n\n\n\n\nAll scheduled dates:\n\n\n\nUpcoming\n\n\n\n\n\n\n\nQuantum Colloquium – The Quantum Fourier Transform Has Small Entanglement\n\n\n\n\n\n\n\nMar. 14, 2023\n\n11 a.m.  –  12 p.m.\n\n\nQuantum Colloquium – The Quantum Fourier Transform Has Small Entanglement\n\n\n\n\n\n\n\n\n\n\n\nShow more\n\n\n\n\n\nPast\n\n\nNo Past activities yet", "start": {"dateTime": "2023-03-14T11:00:00-07:00", "timeZone": "America/Los_Angeles"}, "end": {"dateTime": "2023-03-14T12:00:00-07:00", "timeZone": "America/Los_Angeles"}, "reminders": {"useDefault": true}}, {"summary": "Breakthroughs – Strong Bounds for 3-Progressions", "location": "https://berkeley.zoom.us/j/95040632440", "description": "Description\nAbstract: Suppose you have a set \\( S \\) of integers from \\( \\{1,2,…,N\\} \\) that contains at least \\( N / C \\) elements. Then for large enough \\( N \\), must \\( S\\) contain three equally spaced numbers (i.e., a 3-term arithmetic progression)?\nIn 1953, Roth showed that this is indeed the case when \\( C \\approx (\\log \\log N) \\), while Behrend in 1946 showed that \\( C \\) can be at most \\( 2^{\\Omega(\\sqrt{\\log N})} \\). Since then, the problem has been a cornerstone of the area of additive combinatorics. Following a series of remarkable results, a celebrated paper from 2020 due to Bloom and Sisask improved the lower bound on \\( C \\) to \\( C = (\\log N)^{(1+c)} \\), for some constant \\( c > 0 \\).\nThis talk will describe a new work showing that the same holds when \\( C \\approx 2^{(\\log N)^{0.09}} \\), thus getting closer to Behrend’s construction.\nBased on joint work with Zander Kelley.\n\n\n\n\n\n\n\n\n\n\nAll scheduled dates:\n\n\n\nUpcoming\n\n\n\n\n\n\n\nBreakthroughs – Strong Bounds for 3-Progressions\n\n\n\n\n\n\n\nMar. 16, 2023\n\n3:30   –  4:30 p.m.\n\n\nBreakthroughs – Strong Bounds for 3-Progressions\n\n\n\n\n\n\n\n\n\n\n\nShow more\n\n\n\n\n\nPast\n\n\nNo Past activities yet", "start": {"dateTime": "2023-03-16T15:30:00-07:00", "timeZone": "America/Los_Angeles"}, "end": {"dateTime": "2023-03-16T16:30:00-07:00", "timeZone": "America/Los_Angeles"}, "reminders": {"useDefault": true}}, {"summary": "Richard M. Karp Distinguished Lecture — Gödel and the Vicious Circle: On the (In)Feasibility of Lower Bounds", "location": "https://berkeley.zoom.us/j/95040632440", "description": "Description\nThe NP != P conjecture states that short proofs of mathematical theorems are hard to find efficiently in general. It is often speculated that the conjecture has a self-referential nature: even if there was a relatively short proof of the conjecture itself, this proof might be hard to find. In the first part of this talk, Rahul Santhanam will discuss various situations in which the self-referentiality phenomenon for proving complexity lower bounds can be established formally, and will speculate on the extent to which this is a fundamental obstacle to attacking the P vs. NP problem and others of its kind.\nKnown proof-theoretic barriers to attacking NP vs. P and similar problems apply mostly to non-uniform lower bounds. In the second part of the talk, Santhanam will discuss a new approach to showing uniform lower bounds, which has already led to some progress on lower bounds for weak circuit classes. \nRahul Santhanam is Professor in the Department of Computer Science at the University of Oxford, and Tutorial Fellow at Magdalen College. He received his PhD from the University of Chicago, and taught at the University of Edinburgh after postdoctoral stints in Vancouver and Toronto, before moving to Oxford in 2016. He works across computational complexity theory, including in structural complexity, circuit complexity, proof complexity, foundations of cryptography and learning theory. His recent research is mostly in the study of \"meta-complexity\", i.e., the complexity of complexity, and its applications to various areas of computer science. \n", "start": {"dateTime": "2023-04-11T16:00:00-07:00", "timeZone": "America/Los_Angeles"}, "end": {"dateTime": "2023-04-11T17:00:00-07:00", "timeZone": "America/Los_Angeles"}, "reminders": {"useDefault": true}}]